---
kind: type
id: T:Autodesk.Revit.DB.DWFImportOptions
source: html/8465ab77-dc06-79c2-4bed-e17a564adb22.htm
---
# Autodesk.Revit.DB.DWFImportOptions

The import options used by importing DWF or DWFx format file.

## Syntax (C#)
```csharp
public class DWFImportOptions : IDisposable
```